using System.Collections.Generic;

public class Wordbank9 : AdaptiveWordbankAI
{
    private static readonly string[] words =
    {
        "อนุปุพพิกถาธรรม", "อปริหานิยธรรม", "ปฏิจจสมุปปันนธัมมานุปัสสนา", "สัพพัญญุตญาณ", "พุทธปฏิภาณญาณ", "อภิธรรมปิฎก", "ปฏิปทามัชฌิมา", "อนุปาทิเสสนิพพาน",
        "มหาปรินิพพานสูตร", "ธัมมจักกัปปวัตตนสูตร", "ปฏิจจสมุปปันนธรรมจักร", "สัพเพธรรมอนัตตา", "อนิจจังทุกขังอนัตตา", "สัมโพธิญาณสัมปทา", "วิสุทธิมรรค", "อภิญญาญาณ",
        "มหากรุณาธารธรรม", "ธัมมานุปัสสนาสติปัฏฐาน", "ปรมัตถสัจจกถา", "ปฏิจจสมุปปันนธรรมานุปัสสนา"
    };

    protected override IReadOnlyList<string> OriginalWords => words;
}
